"""
    Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

    Примечание. Высота и ширина прямоугольника равны 
    4 и 17 звёздочкам соответственно.

    Sample Output:

    *****************
    *               *
    *               *
    *****************

"""
print("*****************")
print("*", "*", sep="               ")
print("*", "*", sep="               ")
print("*****************")
