"""
    Дано натуральное число. Напишите программу, которая определяет, состоит ли указанное число из одинаковых цифр.

    Формат входных данных 
    На вход программе подается одно натуральное число.

    Формат выходных данных
    Программа должна вывести «YES» если число состоит из одинаковых цифр и «NO» в противном случае.

    Sample Input 1:
    11111
    Sample Output 1:
    YES
"""
a = int(input())
b = a%10
c = 0
while a != 0:
    if b!=a%10: c+=1
    a //=10

if c==0 : print("YES")
else: print("NO")