"""
    Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.
"""
a,b,c = int(input()), int(input()), int(input())
print(a+b+c)