"""
    Напишите программу, вычисляющую объём куба и площадь его полной поверхности по введенному значению длины ребра.
"""
a = int(input())
s=6*a**2
v=a**3
print("Объем =", v)
print("Площадь полной поверхности =", s)